/*git 프로젝트
git은 뭔가?
1. 형상관리도구중에 하나
 - 형상관리도구 : 버전 관리 시스템
 - 작업을 하면서 작업의 리스트를 관리 할 수 있다.

2.git의 장점
 : 협업하는 단계에서 소스코드를 주고 받을 필요 없이 같은 파일을
 팀원들과 동시에 병렬로 작업이 가능하다.

 - ex)
    A가 작업을 하고 -> B에게 작업을 넘겨주는데 
    A랑 B랑 메인페이지를 같이 작업하있는경우
    A는 상품페이지, B는 장바구니 페이지
    파일로 넘겨주고 어디가 다른지 눈으로 보고 이런식으로 작업하게 되면
    시간도 오래걸리고 디버깅도 힘들다.

 - 서버에 서로 푸쉬를 하면 서버에 있는 파일이 자동으로 갱신된다.
    A랑 B랑 작업하는데 C라는 팀원이 추가되었다.
    git을 사용하면 A와B의 파일을 C에게 줄 필요 없이 
    git에서 클론으로 파일을 내려받아서 바로 작업이 가능하다.

3. 소스제어 탭의 git 그래프
 - U : 저장소에 없는 새로운 파일
 - M : 저장소에 파일은 있고 내용이 변경되었을때
 - D : 저장소에 있는 파일이 제거되었을때

4. git 저장소(터미널의 노란색)가 초기화 된 경로인지 확인 잘하고 사용
  (초기화 경로는 git init을 한 경로)

5. git 명령어
 - cd "변경할 경로(폴더)" : 경로 변경시 사용
 - cd .. : 상위경로로 올라감
 - ls : 경로에 있는 파일 확인

6. git 설정
ㅁ나느




*/